# Formula
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Packages
brew "bash-completion"
brew "ccat"
brew "coreutils"
brew "curl"
brew "direnv"
brew "ghq"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "graphviz"
brew "grpc"
brew "htop"
brew "jq"
brew "mas"
brew "nkf"
brew "peco"
brew "protobuf"
brew "trash"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-completions"

# C, C++
brew "boost"
brew "make"
brew "cmake"

# CSharp
brew "mono"
brew "nuget"

# Java
brew "java"

# Ruby
brew "rbenv"
brew "rbenv-gemset"

# Python
brew "pyenv"

# Node.js
brew "nodenv"

# Go
brew "goenv", args: ["HEAD"]

# Kubernetes
brew "kubernetes-cli"
brew "kind"

# Editors
brew "vim"

# Terminal
cask "iterm2"

# Fonts
cask "font-hack-nerd-font"

# Inputs
cask "alfred"
cask "aquaskk"
cask "karabiner-elements"
cask "cheatsheet"
cask "rectangle"

# Browsers
cask "google-chrome"

# Development Tools
cask "dash"
cask "docker"
cask "google-cloud-sdk"
cask "unity-hub"
cask "wireshark"

# IDEs
cask "jetbrains-toolbox"

# Editors
cask "visual-studio-code"

# Misc
cask "1password"
cask "kindle"
cask "slack"
cask "tomighty"
cask "zoom"

