# Formula
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# Packages
brew "bash-completion"
brew "coreutils"
brew "curl"
brew "direnv"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "graphviz"
brew "hub"
brew "htop"
brew "mas"
brew "nkf"
brew "peco"
brew "protobuf"
brew "thefuck"
brew "trash"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-completions"

# C, C++
brew "boost"
brew "make"
brew "cmake"

# CSharp
brew "mono"
brew "nuget"

# Ruby
brew "rbenv"
brew "rbenv-gemset"

# Python
brew "pyenv"

# Servers
brew "httpd"
brew "nginx"

# Databases
brew "mysql", restart_service: true
brew "redis"

# Editors
brew "vim"

# Terminal
cask "iterm2"

# Fonts
cask "font-hack-nerd-font"

# Inputs
cask "alfred"
cask "aquaskk"
cask "karabiner-elements"
cask "cheatsheet"
cask "spectacle"

# Browsers
cask "firefox"
cask "google-chrome"

# Development Tools
cask "java"
cask "dash"
cask "docker"
cask "unity-hub"
cask "wireshark"

# IDEs
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "atom"

# Misc
cask "kindle"
cask "slack"
cask "tomighty"
cask "0xed"

