# Formula
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

# Packages
brew "bash-completion"
brew "coreutils"
brew "curl"
brew "git"
brew "git-lfs"
brew "graphviz"
brew "htop"
brew "nkf"
brew "thefuck"
brew "trash"
brew "tree"
brew "wget"

# C, C++
brew "boost"
brew "make"
brew "cmake"

# CSharp
brew "mono"
brew "nuget"

# Ruby
brew "rbenv"
brew "rbenv-gemset"

# Servers
brew "httpd"
brew "nginx"

# Databases
brew "mysql", restart_service: true
brew "redis"

# Editors
brew "vim"

# Terminal
cask "iterm2"

# Inputs
cask "alfred"
cask "aquaskk"
cask "cmd-eikana"
cask "qblocker"
cask "cheatsheet"

# Browsers
cask "firefox"
cask "google-chrome"

# Development Tools
cask "java"
cask "dash"
cask "docker"

# IDEs
cask "jetbrains-toolbox"
cask "atom"

# Misc
cask "kindle"
cask "slack"
cask "tomighty"
cask "0xed"

