# Packages
brew "bash-completion"
brew "ccat"
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "direnv"
brew "fd"
brew "fzf"
brew "ghq"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "graphviz"
brew "grpc"
brew "htop"
brew "jq"
brew "mas"
brew "nkf"
brew "protobuf"
brew "tig"
brew "trash"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-completions"

# C, C++
brew "boost"
brew "make"
brew "cmake"

# CSharp
brew "mono"
brew "dotnet"
brew "nuget"

# Java
brew "java"

# Tool Version Manager
brew "mise"

# Kubernetes
brew "kubernetes-cli"
brew "kind"
brew "helm"

# Editors
brew "vim"

# Terminal
cask "ghostty"

# Fonts
cask "font-hack-nerd-font"

# Inputs
cask "alfred"
cask "aquaskk"
cask "karabiner-elements"
cask "rectangle"

# Browsers
cask "google-chrome"

# Development Tools
cask "claude-code"
cask "docker-desktop"
cask "devtoys"
cask "gcloud-cli"
cask "unity-hub"
cask "wireshark-app"

# IDEs
cask "jetbrains-toolbox"

# Editors
cask "visual-studio-code"

# Misc
cask "1password"
cask "slack"

